clear;
clc;

%% 関数フォルダ
addpath("../code/functions/");


%% ------------------------------------------------
% EEGファイルを選択
%% ------------------------------------------------

[file_name, folder_path] = uigetfile( ...
    '*.set', ...
    'EEGファイルを選択してください' ...
);

if isequal(file_name, 0)
    disp('ファイル選択をキャンセルしました。');
    return;
end

file_path = fullfile( ...
    folder_path, ...
    file_name ...
);


%% ------------------------------------------------
% 保存先フォルダを選択
%% ------------------------------------------------

save_dir = uigetdir( ...
    folder_path, ...
    '画像の保存先フォルダを選択してください' ...
);

if isequal(save_dir, 0)
    disp('保存先の選択をキャンセルしました。');
    return;
end


%% ------------------------------------------------
% 表示設定
%% ------------------------------------------------

channels_per_fig = 20;

title_name = "Post MF";


%% ------------------------------------------------
% EEG波形を作成・保存
%% ------------------------------------------------

plot_eeg_split( ...
    file_path, ...
    channels_per_fig, ...
    save_dir, ...
    title_name ...
);